---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT
source: html/308dc954-e403-b95c-3f1c-3a9a4c22beaf.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT

Defines parameters for Tees shape.

## Syntax (C#)
```csharp
public class StructuralSectionGeneralT : StructuralSectionHotRolled
```